# გამოიტანეთ თქვენი სახელი და გვარი იმდენჯერ, რამდენი წლისაც ხართ
for i in range (15):
    print("mari surguladze")

# გამოიტანეთ ტერმინალში რიცხვები 1-დან 20-ის ჩათვლით
for i in range (1,21):
    print(i)

# გამოიტანეთ ტერმინალში რიცხვები 20-დან 0-მდე
for i in range (20, -1, -1):
    print(i)

# გამოიტანეთ რიცხვები 10-დან 15-მდე
i = 10
while i < 15:
    print(i)
    i += 1

# გამოიტანეთ რიცხვები 50-დან 0-მდე
i= 50
while i < 0:
    print(i)
    i += 1

# კომენტარის სახით ახსენით რა არის counter ცვლადი და როდის ვიყენებთ While Loop-ს
# counter ცვლადი არის ცვლადი, რომელიც გამოიყენება while loop-ში ვითარების ცვლილებისთვის, 
# მაგალითად, ვიწყებთ i = 0-ით და ყოველ ციკლში ვზრდით, რათა ერთ დროს გავიდეს loop-იდან
# while loop-ს ვიყენებთ, როცა არ ვიცით ზუსტად რამდენჯერ უნდა განმეორდეს მოქმედება, და გვინდა გაგრძელდეს მანამ, სანამ პირობა არის True

# გამოიტანეთ მხოლოდ ლუწი რიცხვები 10-დან 70-მდე
i = 10
while i < 70:
    print(i)
    i += 0

# გამოიტანეთ კენტი რიცხვები 25-დან 55-მდე
i = 25
while i < 55:
    print(i)
    i += 0