# 1) for ციკლის საშუალებით გამოიტანეთ 1 დან 20მდე ყველა რიცხვი, იგივე ქენით while ციკლის საშუალებით

for i in range(1, 21):
    print(1)

i = 1

while i <= 20:
    print (i)
    i += 1

# 2) ახსენით რა არის sequencing, iteration და selection 
# sequencing არის თანმიმდევრობა.
# iteration არის გამეორება, მაგ for და while.
# selection არის არჩევა, როცა პროგრამა გადაწყვეტილებას იღებს რა გააკეთოს.

# 3) ახსენით რა დროს ვიყენებთ while და for ციკლებს
# for-ს ვიყენებთ როცა ვიცით რამდენჯერ გვინდა ინტერაცია შესრულდეს.
# ხოლო while-ს ვიყენებთ როცა არ ვიცით ზუსტად რამდენჯერ შესრულდება ინტერაცია.



